import {
  HairExtension,
  HairDye,
  HairIron,
  HairStraightener,
} from "assets/icons";
import { IServiceData } from "./interface";

export const servicesData = [
  {
    slug: "kholodne-vidnovlennya",
    icon: <HairExtension size={50} color="#fff" />,
    title: "Холодне відновлення",
    desc:
      "Холодне молекулярне відновлення волосся направлене на поповнення в пошкодженому волоссі кератину.",
    colors: {
      from: "#24e2fe",
      to: "#237efd",
    },
    images: "/images/holodne.jpg",
    infoBlock: {
      img: "/images/termoobrabotka-1024x577.jpg",
      title: "Горячий ботокс",
      desc:
        "Гарячий ботокс призначений для тих, кого, крім оздоровлення, цікавить ще й випрямлення кучерявого, неслухняного, пухнастих волосся. Багато хто плутає гарячий ботокс з такими процедурами, як кератіновие випрямлення і нанопластіка, проте між ними є кілька принципових відмінностей.",
    },
    infoBlockReverse: {
      img: "/images/termoobrabotka-1024x577.jpg",
      title: "Горячий ботокс",
      list: [
        "Структура волосся відновлюється за рахунок заповнення пустот молекулами інтра- силана: вони стають гладкими, рівними і слухняними.",
        "Додатково живить волосяні цибулини.",
        "Стрижні волосся реконструюються по всій довжині.",
        "Волосся знаходять здоровий блиск.",
        "Результат видно відразу після процедури.",
      ],
    },
    numbers: {
      title: "Послідовність",
      desc:
        "Товарищи! рамки и место обучения кадров представляет собой интересный эксперимент проверки модели развития. Таким образом постоянный количественный рост и сфера нашей активности способствует подготовки и реализации систем массового участия.",
      list: [
        {
          title: "Миємо волосся",
          desc:
            "Очищаємо волосся та відкриваємо кутикулу волосини для покращення проникнення кератину.",
        },
        {
          title: "Перевіка пошкодження",
          desc: "Перевіряємо волосся на в'язкість та міцність волосини.",
        },
        {
          title: "Визначення процедури",
          desc: "Завдяки ступені пошкодження волосся підбераємо процедуру.",
        },
        {
          title: "Підготовка",
          desc: "Підготовляємо волосся до вибраної процеду.",
        },
        {
          title: "Нанесення",
          desc:
            "Наносимо склад процедури витримуючу певний час за даною процедурою та чекаємо наступного етапу",
        },
        {
          title: "Випарювання",
          desc:
            "Випарюючи скрад волосина впитує всі компоненти, насичується і стає еластичнішою.",
        },
      ],
    },
  },
  {
    slug: "botoks",
    icon: <HairDye size={50} color="#fff" />,
    title: "Ботокс",
    desc:
      "Ботокс - це процедура спрямована на відновлення і оздоровлення пасм.",
    colors: {
      from: "#ffd324",
      to: "#fda323",
    },
    images: "/images/holodne.jpg",
    numbers: {
      title: "Послідовність",
      desc:
        "Товарищи! рамки и место обучения кадров представляет собой интересный эксперимент проверки модели развития. Таким образом постоянный количественный рост и сфера нашей активности способствует подготовки и реализации систем массового участия.",
      list: [
        {
          title: "Миємо волосся",
          desc:
            "Очищаємо волосся та відкриваємо кутикулу волосини для покращення проникнення кератину.",
        },
        {
          title: "Перевіка пошкодження",
          desc: "Перевіряємо волосся на в'язкість та міцність волосини.",
        },
        {
          title: "Визначення процедури",
          desc: "Завдяки ступені пошкодження волосся підбераємо процедуру.",
        },
        {
          title: "Підготовка",
          desc: "Підготовляємо волосся до вибраної процеду.",
        },
        {
          title: "Нанесення",
          desc:
            "Наносимо склад процедури витримуючу певний час за даною процедурою та чекаємо наступного етапу",
        },
        {
          title: "Випарювання",
          desc:
            "Випарюючи скрад волосина впитує всі компоненти, насичується і стає еластичнішою.",
        },
      ],
    },
    infoBlock: {
      img: "/images/termoobrabotka-1024x577.jpg",
      title: "Горячий ботокс",
      desc:
        "Гарячий ботокс призначений для тих, кого, крім оздоровлення, цікавить ще й випрямлення кучерявого, неслухняного, пухнастих волосся. Багато хто плутає гарячий ботокс з такими процедурами, як кератіновие випрямлення і нанопластіка, проте між ними є кілька принципових відмінностей.",
    },
    infoBlockReverse: {
      img: "/images/termoobrabotka-1024x577.jpg",
      title: "Горячий ботокс",
      list: [
        "Структура волосся відновлюється за рахунок заповнення пустот молекулами інтра- силана: вони стають гладкими, рівними і слухняними.",
        "Додатково живить волосяні цибулини.",
        "Стрижні волосся реконструюються по всій довжині.",
        "Волосся знаходять здоровий блиск.",
        "Результат видно відразу після процедури.",
      ],
    },
  },
  {
    slug: "keratyn",
    icon: <HairIron size={50} color="#fff" />,
    title: "Кератин",
    desc:
      "Кератин - це білок, який складається з величезної кількості різновидних амінокислот.",
    colors: {
      from: "#f82fa0",
      to: "#b43dff",
    },
    images: "/images/holodne.jpg",
    numbers: {
      title: "Послідовність",
      desc:
        "Товарищи! рамки и место обучения кадров представляет собой интересный эксперимент проверки модели развития. Таким образом постоянный количественный рост и сфера нашей активности способствует подготовки и реализации систем массового участия.",
      list: [
        {
          title: "Миємо волосся",
          desc:
            "Очищаємо волосся та відкриваємо кутикулу волосини для покращення проникнення кератину.",
        },
        {
          title: "Перевіка пошкодження",
          desc: "Перевіряємо волосся на в'язкість та міцність волосини.",
        },
        {
          title: "Визначення процедури",
          desc: "Завдяки ступені пошкодження волосся підбераємо процедуру.",
        },
        {
          title: "Підготовка",
          desc: "Підготовляємо волосся до вибраної процеду.",
        },
        {
          title: "Нанесення",
          desc:
            "Наносимо склад процедури витримуючу певний час за даною процедурою та чекаємо наступного етапу",
        },
        {
          title: "Випарювання",
          desc:
            "Випарюючи скрад волосина впитує всі компоненти, насичується і стає еластичнішою.",
        },
      ],
    },
    infoBlock: {
      img: "/images/termoobrabotka-1024x577.jpg",
      title: "Горячий ботокс",
      desc:
        "Гарячий ботокс призначений для тих, кого, крім оздоровлення, цікавить ще й випрямлення кучерявого, неслухняного, пухнастих волосся. Багато хто плутає гарячий ботокс з такими процедурами, як кератіновие випрямлення і нанопластіка, проте між ними є кілька принципових відмінностей.",
    },
    infoBlockReverse: {
      img: "/images/termoobrabotka-1024x577.jpg",
      title: "Горячий ботокс",
      list: [
        "Структура волосся відновлюється за рахунок заповнення пустот молекулами інтра- силана: вони стають гладкими, рівними і слухняними.",
        "Додатково живить волосяні цибулини.",
        "Стрижні волосся реконструюються по всій довжині.",
        "Волосся знаходять здоровий блиск.",
        "Результат видно відразу після процедури.",
      ],
    },
  },
  {
    slug: "nanoplastyka",
    icon: <HairStraightener size={50} color="#fff" />,
    title: "Нанопластика",
    desc:
      "Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat",
    colors: {
      from: "#00bc80",
      to: "#03dc0d",
    },
    images: "/images/holodne.jpg",
    numbers: {
      title: "Послідовність",
      desc:
        "Товарищи! рамки и место обучения кадров представляет собой интересный эксперимент проверки модели развития. Таким образом постоянный количественный рост и сфера нашей активности способствует подготовки и реализации систем массового участия.",
      list: [
        {
          title: "Миємо волосся",
          desc:
            "Очищаємо волосся та відкриваємо кутикулу волосини для покращення проникнення кератину.",
        },
        {
          title: "Перевіка пошкодження",
          desc: "Перевіряємо волосся на в'язкість та міцність волосини.",
        },
        {
          title: "Визначення процедури",
          desc: "Завдяки ступені пошкодження волосся підбераємо процедуру.",
        },
        {
          title: "Підготовка",
          desc: "Підготовляємо волосся до вибраної процеду.",
        },
        {
          title: "Нанесення",
          desc:
            "Наносимо склад процедури витримуючу певний час за даною процедурою та чекаємо наступного етапу",
        },
        {
          title: "Випарювання",
          desc:
            "Випарюючи скрад волосина впитує всі компоненти, насичується і стає еластичнішою.",
        },
      ],
    },
    infoBlock: {
      img: "/images/termoobrabotka-1024x577.jpg",
      title: "Горячий ботокс",
      desc:
        "Гарячий ботокс призначений для тих, кого, крім оздоровлення, цікавить ще й випрямлення кучерявого, неслухняного, пухнастих волосся. Багато хто плутає гарячий ботокс з такими процедурами, як кератіновие випрямлення і нанопластіка, проте між ними є кілька принципових відмінностей.",
    },
    infoBlockReverse: {
      img: "/images/termoobrabotka-1024x577.jpg",
      title: "Горячий ботокс",
      list: [
        "Структура волосся відновлюється за рахунок заповнення пустот молекулами інтра- силана: вони стають гладкими, рівними і слухняними.",
        "Додатково живить волосяні цибулини.",
        "Стрижні волосся реконструюються по всій довжині.",
        "Волосся знаходять здоровий блиск.",
        "Результат видно відразу після процедури.",
      ],
    },
  },
];

export const serviceData = (slug: string): IServiceData => {
  return servicesData.filter((el) => el.slug === slug)[0];
};
